lambda/src/test/resources/Migrations/Membership2025/sub1/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 18,
  "revision": "18.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2014-09-10",
  "serviceActivationDate": "2014-09-10",
  "customerAcceptanceDate": "2014-09-10",
  "subscriptionStartDate": "2014-09-10",
  "subscriptionEndDate": "2026-07-17",
  "lastBookingDate": "2025-07-17",
  "termStartDate": "2025-07-17",
  "termEndDate": "2026-07-17",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 7.0,
  "totalContractedValue": 556.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": null,
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a128182980d17de0198165347236f54",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92a0f94c547592014c69f5b0ff4f7e",
      "productRatePlanNumber": null,
      "ratePlanName": "Non Founder Supporter - monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01336562",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128182980d17de0198165347266f56",
          "originalChargeId": "2c92a0fe64a5d55b0164a779b806494f",
          "productRatePlanChargeId": "2c92a0f94c547592014c69f5b1204f80",
          "number": "C-01336562",
          "name": "Supporter Membership - Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 6,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2018-07-17",
          "effectiveEndDate": "2023-05-17",
          "processedThroughDate": "2023-05-17",
          "chargedThroughDate": "2023-05-17",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.0,
          "dmrc": 0.0,
          "tcv": 290.0,
          "dtcv": -10.0,
          "originalOrderDate": "2018-07-17",
          "amendedByOrderOn": "2023-04-14",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 5.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP5",
          "price": 5.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128182980d17de0198165347296f5a",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "8a1287c586832d250186a2040b1548fe",
      "productRatePlanNumber": null,
      "ratePlanName": "Supporter - monthly (2023 Price)",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04262713",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128182980d17de01981653472b6f5c",
          "originalChargeId": "8a129a30877e485c01877f3d04402e87",
          "productRatePlanChargeId": "8a12800986832d1d0186a20bf5136471",
          "number": "C-04262713",
          "name": "Supporter Membership - Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-05-17",
          "effectiveEndDate": "2026-07-17",
          "processedThroughDate": "2025-09-17",
          "chargedThroughDate": "2025-10-17",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 7.0,
          "dmrc": 0.0,
          "tcv": 266.0,
          "dtcv": 84.0,
          "originalOrderDate": "2023-04-14",
          "amendedByOrderOn": "2025-07-17",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 7.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP7",
          "price": 7.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128182980d17de01981653472e6f60",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0fb4ce4b8e7014ce711d3c37e60",
      "productRatePlanNumber": null,
      "ratePlanName": "Friends",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00101877",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128182980d17de0198165347316f62",
          "originalChargeId": "2c92a0f94ddca941014de2b7d6fc02ae",
          "productRatePlanChargeId": "2c92a0f94ce4ab75014ce713810805ed",
          "number": "C-00101877",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2015-06-11",
          "effectiveEndDate": "2015-06-12",
          "processedThroughDate": "2015-06-12",
          "chargedThroughDate": "2015-06-12",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2015-06-11",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128182980d17de0198165347336f65",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0f9479fb46d0147d0155c6f558b",
      "productRatePlanNumber": null,
      "ratePlanName": "Friend",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00002654",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128182980d17de0198165347356f67",
          "originalChargeId": "2c92a0f948444e3801486163819405f2",
          "productRatePlanChargeId": "2c92a0fb479fbd5d0147d01561c245f6",
          "number": "C-00002654",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2014-09-10",
          "effectiveEndDate": "2015-06-11",
          "processedThroughDate": "2015-06-11",
          "chargedThroughDate": "2015-06-11",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2014-09-10",
          "amendedByOrderOn": "2015-06-11",
          "description": null,
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04683677",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2014-09-10",
      "endDate": "2026-07-17",
      "status": "Active"
    },
    {
      "startDate": "2026-07-17",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-07-17 04:00:13",
  "updateTime": "2025-09-17 04:00:16",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
