lambda/src/test/resources/Migrations/Membership2025/sub3/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 18,
  "revision": "18.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2014-09-10",
  "serviceActivationDate": "2014-09-10",
  "customerAcceptanceDate": "2014-09-10",
  "subscriptionStartDate": "2014-09-10",
  "subscriptionEndDate": "2026-03-31",
  "lastBookingDate": "2025-03-31",
  "termStartDate": "2025-03-31",
  "termEndDate": "2026-03-31",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 6.25,
  "totalContractedValue": 493.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": null,
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "United Kingdom"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12871595db9dd80195ea2bb98a07b5",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92a0fb4c5481db014c69f4a1e03bbd",
      "productRatePlanNumber": null,
      "ratePlanName": "Non Founder Supporter - annual",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00953141",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12871595db9dd80195ea2bb98e07b7",
          "originalChargeId": "2c92a0fe5b1ae7a9015b23e8defb370a",
          "productRatePlanChargeId": "2c92a0fb4c5481db014c69f4a2013bbf",
          "number": "C-00953141",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 7,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-03-31",
          "effectiveEndDate": "2024-03-31",
          "processedThroughDate": "2024-03-31",
          "chargedThroughDate": "2024-03-31",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 4.083333333,
          "dmrc": 0.0,
          "tcv": 343.0,
          "dtcv": 49.0,
          "originalOrderDate": "2017-03-31",
          "amendedByOrderOn": "2023-03-31",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 49.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP49",
          "price": 49.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12871595db9dd80195ea2bb99107ba",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "8a129ce886834fa90186a20c3ee70b6a",
      "productRatePlanNumber": "PRP-00000182",
      "ratePlanName": "Supporter - annual (2023 Price)",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05078980",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12871595db9dd80195ea2bb99307bc",
          "originalChargeId": "8a12981c8dd0800a018de96a229c0495",
          "productRatePlanChargeId": "8a129ce886834fa90186a20c3f4f0b6c",
          "number": "C-05198673",
          "name": "Supporter Membership - Annual",
          "productRatePlanChargeNumber": "PRPC-00000284",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 3,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-03-31",
          "effectiveEndDate": "2026-03-31",
          "processedThroughDate": "2025-03-31",
          "chargedThroughDate": "2026-03-31",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 6.25,
          "dmrc": 0.0,
          "tcv": 150.0,
          "dtcv": 75.0,
          "originalOrderDate": "2024-02-27",
          "amendedByOrderOn": "2025-03-31",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 75.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP75",
          "price": 75.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12871595db9dd80195ea2bb99507bf",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0fb4ce4b8e7014ce711d3c37e60",
      "productRatePlanNumber": null,
      "ratePlanName": "Friends",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00101463",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12871595db9dd80195ea2bb99807c1",
          "originalChargeId": "2c92a0fb4ddcb9de014de2b6c03e2e47",
          "productRatePlanChargeId": "2c92a0f94ce4ab75014ce713810805ed",
          "number": "C-00101463",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2015-06-11",
          "effectiveEndDate": "2015-06-12",
          "processedThroughDate": "2015-06-12",
          "chargedThroughDate": "2015-06-12",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2015-06-11",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12871595db9dd80195ea2bb99a07c4",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0f9479fb46d0147d0155c6f558b",
      "productRatePlanNumber": null,
      "ratePlanName": "Friend",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00002143",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12871595db9dd80195ea2bb99d07c6",
          "originalChargeId": "2c92a0fb48445b9c014860f9c93d53d0",
          "productRatePlanChargeId": "2c92a0fb479fbd5d0147d01561c245f6",
          "number": "C-00002143",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2014-09-10",
          "effectiveEndDate": "2015-06-11",
          "processedThroughDate": "2015-06-11",
          "chargedThroughDate": "2015-06-11",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2014-09-10",
          "amendedByOrderOn": "2015-06-11",
          "description": null,
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-04254188",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2014-09-10",
      "endDate": "2026-03-31",
      "status": "Active"
    },
    {
      "startDate": "2026-03-31",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-03-31 04:08:08",
  "updateTime": "2025-03-31 04:08:09",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
