lambda/src/test/resources/Migrations/Membership2025/sub4/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 16,
  "revision": "16.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2014-09-10",
  "serviceActivationDate": "2014-09-10",
  "customerAcceptanceDate": "2014-09-10",
  "subscriptionStartDate": "2014-09-10",
  "subscriptionEndDate": "2026-01-28",
  "lastBookingDate": "2025-01-28",
  "termStartDate": "2025-01-28",
  "termEndDate": "2026-01-28",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 5.0,
  "totalContractedValue": 600.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": null,
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": null,
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "LastPlanAddedDate__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "United Kingdom"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a128bc49498ceb60194ab2b75fc5746",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4bb97034014bbbc561fa4fed",
      "productName": "Supporter",
      "productSku": "SKU-00000013",
      "productRatePlanId": "2c92a0f94c547592014c69f5b0ff4f7e",
      "productRatePlanNumber": null,
      "ratePlanName": "Non Founder Supporter - monthly",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00202305",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128bc49498ceb60194ab2b75ff5748",
          "originalChargeId": "2c92a0fd5286d5cb01528985b84c2b71",
          "productRatePlanChargeId": "2c92a0f94c547592014c69f5b1204f80",
          "number": "C-00202305",
          "name": "Supporter Membership - Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 10,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-01-28",
          "effectiveEndDate": "2026-01-28",
          "processedThroughDate": "2025-09-28",
          "chargedThroughDate": "2025-10-28",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.0,
          "dmrc": 0.0,
          "tcv": 600.0,
          "dtcv": 60.0,
          "originalOrderDate": "2016-01-28",
          "amendedByOrderOn": "2025-01-28",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 5.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP5",
          "price": 5.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128bc49498ceb60194ab2b7602574b",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0fb4ce4b8e7014ce711d3c37e60",
      "productRatePlanNumber": null,
      "ratePlanName": "Friends",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00100944",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128bc49498ceb60194ab2b7604574d",
          "originalChargeId": "2c92a0fb4ddcb9de014de2b5b8981d97",
          "productRatePlanChargeId": "2c92a0f94ce4ab75014ce713810805ed",
          "number": "C-00100944",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2015-06-11",
          "effectiveEndDate": "2015-06-12",
          "processedThroughDate": "2015-06-12",
          "chargedThroughDate": "2015-06-12",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2015-06-11",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a128bc49498ceb60194ab2b76075750",
      "lastChangeType": "Remove",
      "productId": "2c92a0f9479fb46d0147d0155a2a5546",
      "productName": "Friend",
      "productSku": "SKU-00000005",
      "productRatePlanId": "2c92a0f9479fb46d0147d0155c6f558b",
      "productRatePlanNumber": null,
      "ratePlanName": "Friend",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-00001547",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a128bc49498ceb60194ab2b76095752",
          "originalChargeId": "2c92a0fb48445b9f0148607ea20c5576",
          "productRatePlanChargeId": "2c92a0fb479fbd5d0147d01561c245f6",
          "number": "C-00001547",
          "name": "Friends Membership",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2014-09-10",
          "effectiveEndDate": "2015-06-11",
          "processedThroughDate": "2015-06-11",
          "chargedThroughDate": "2015-06-11",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "ContractEffective",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2014-09-10",
          "amendedByOrderOn": "2015-06-11",
          "description": null,
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 0.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-03988453",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2014-09-10",
      "endDate": "2026-01-28",
      "status": "Active"
    },
    {
      "startDate": "2026-01-28",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-01-28 04:28:59",
  "updateTime": "2025-09-28 04:41:07",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null,
  "communicationProfileId": null
}
